{"In which TV series did we meet Nurse Gladys Emmanuel?": "Open All Hours", "The 40 Year Old Virgin was released in which year?": "2005", "Judge Doom is a character in which animated film?": "Who Framed Roger Rabbit", "What music genre is most often associated with Bad Religion?": "Punk", "Complete this film title: Ace Ventura, Detective.": "Pet", "In what movie does Will Ferrell play the evil fashion mogul Jacobim Mugatu?": "Zoolander", "Which P is a group from the US? A": "1940", "What is Tina Turner's real surname? A": "Bullock", "What's the name of the animated film character 'The Little Mermaid'?": "Ariel", "What is Charlie's profession in 'Two anda Half Men’?": "Jingle Writer", "Who played Mimsy Borogroves in the TV comedy ‘Wings’?": "Tyne Daly", "Which of these bands is not Welsh? A": "The Cardigans", "What legendary actor voiced Unicorn in the 1986 movie 'The Transformers Movie’?": "Orson Welles", "Who was the drummer for Thin Lizzy? A": "Brian Downey", "Grant and Phil Mitchell appear in which British Soap?": "Eastenders", "Which band won the 2013 Best Song award at the Hollywood Film Awards?": "Coldplay", "Which cartoon character has a dog called Gnasher?": "Dennis the Menace", "In 2000 which artist released the UK number 1 single ‘Stan’?": "Eminem", "Which comedian was often accompanied by/his Diddymen?": "Ken Dodd", "What is American soul and R&B singer Marie Dionne's surname?": "Warwick", "Who provided the voice of Rango in \"Rango\"?": "Johnny Depp", "Who is the creative director of 'The 'X Factor’ USA’?": "Brian Friedman", "The lead singer of Pulp is, who? A": "Jarvis Cocker", "What fairy tale character is caught wearing a thong in ‘Shrek 2'?": "Pinocchio", "What is Sade's real first name? A": "Platoon", "Which animated film features the song 'A Whole New World’?": "Aladdin", "Undertow is a character in which animated film?": "The Little Mermaid", "What could 1960s horse Mr Ed do? A": "Talk", "What first appeared on TV in 1984? A": "Infomercials", "In 'Lost', which character was a professor at/Oxford?": "Daniel Faraday", "Which reality show did Hayden Quinn make hisname in?": "MasterChef", "What legendary animator and artist directed \"An American Tail\"?": "Don Bluth", "Lena Dunham is the star of which US TV hit show?": "Girls", "What US state is nicknamed \"The Silver State\"?": "Nevada", "Which of the following is not an element of Cracker Jacks?": "Oats", "Who is the leading NHL points scorer from N Orway?": "Espen Knutsen", "Independence Hall is found in which US city?": "Philadelphia", "Finish the name of the British rock group: The Stone .": "Roses", "Which sport's name means ‘gentle way’? A": "vuUuUY", "Ketchup is a sauce traditionally with a base of what ingredient?": "Tomato", "Australian Cathy Freeman won a gold medal in which event in 2000?": "400m", "Which continent do giraffes live? A": "Africa", "In what year did a stamp collecting merit badge become available in the Boy Scouts?": "1922", "In which American state would you find Biloxi?": "Mississippi", "Across what river is the Aswan Dam situated?": "The Nile", "Who was picked first in the 1990 Major League Baseball Draft?": "Chipper Jones", "Which animal was a hit for R.E.M. ? A": "Hyena", "In baseball, how many strikeouts did record holder Nolan Ryan record in 1973?": "383", "Which ship that brought the Pilgrims to Plymouth, Massachusetts in 1602?": "Mavflower", "Which country lies immediately east of Chile?": "Argentina", "The longest river in the world is the, what? A": "INTIN", "What is Cilla Black's real surname? A": "White", "Which cartoon character made his first appearance in 1978?": "Garfield", "How are cakes cooked? A": "Baked", "Which of these men was not a member of the Founding Fathers of the United States?": "Julius Caesar", "The Shard became the tallest building in which country in 2013?": "England", "What color is Nigeria's home strip? A": "Green", "What U.S. President is featured on the $20 bill": "Andrew Jackson", "What are lions also known as? A": "King Of The Jungle", "What group or artist is known for the 1982 song ‘Our House’?": "Madness", "Toronto stands on which of the Great Lakes?": "Ontario", "Who was named 2010 NBA All-Star game MMP?": "Dwavne Wade", "In physics, ‘kinetics’ is the study of what?": "MVMVUIGSV IPE TEI", "Who did Barack Obama defeat to become the 44th President of the United States?": "John McCain", "England's Gary Lineker was top scorer at the Mexico World Cup in what year?": "1986", "Which tiny nation sits on the French Riviera?": "Monaco", "Which US City is known as the Scenic City? A": "MTIALaIUY YG", "How many times a year do dingoes breed? A": "", "Which of these is a major city in England? A": "VIN", "Where would you wear espadrilles? A": "On your feet", "How many bones are in the hand? A": "2/7", "The Hawkeye State is a name for which state?": "lowa", "What might you put in the 'pit' in a theatre?": "FATT VIUIIeouUda", "In what year did a Chevrolet car first win a NASCAR race?": "1950", "Opened in 1965, what was, at the time, the tallest building in Britain?": "Post Office Tower", "Which Australian Female won the 400m gold medal at the 2000 Sydney Olympics?": "Cathy Freeman", "Who had a hit with 'The Children of the Revolution’ in 1972?": "T. Rex", "Which of these dance crazes came first? A": "IVIVULIVV GIN", "Which of these dog breeds is the smallest? A": "WET", "What is the capital of the US State Idaho? A": "", "What is measured in denier and tex? A": "The fineness of fibers and", "Approximately how long is your appendix?": "wll", "How wide is the wingspan of a flying fox? A": "", "Mount McKinley can be found in which state?": "Alaska", "In which city did Al Capone establish his criminal organization?": "Chicago", "Mayim Bialik was the teen star of which ‘90s TV show?": "Blossom", "Approximately how many islands make up Hawaii?": "130", "Who were Reese's Peanut Butter A Cups invented by?": "", "The Eiffel tower is in which European city? A": "", "Which team passed the fewest yards in the 2013 NFL season?": "Tampa Bay Buccaneers", "In 1976 which women became the first women to compete in a NASCAR Winston am": "a", "What is the official language of Thailand? A": "rica", "What sea is 8.6 times saltier than the ocean?": "The Dead Sea", "Which team passed the most yards in the 2013 NFL season?": "Denver Broncos", "A female giraffe is known as a what? A": "vue", "Which of the following is a rap hit featuring Shaquille O'Neal?": "What's Up Doc", "What is a another name for a chrysalis? A": "ruypa", "Nickelback hail from which country? A": "Canada", "How long is a day on Venus? A": "", "In what year was the first NASCAR race held?": "1949", "In rowing, you make the boat move with what?": "Oars", "What colour is the meat inside a lychee? A": "VVITICU", "Which base does base C join with? A": "", "Hockey is played with what? A": "Stick", "A thermometer is a device used to measure what?": "Temperature", "In March, 2008 which country held its first ever general elections?": "", "The temple of Angkor Wat is in which country?": "Cambodia", "F. Gary Gray directed a biopic of which musical group in a 2015 film release?": "NWA", "What type of sea creature is a Medusa?": "Vvellyttio", "What is the unit of currency in Switzerland? A": "WVVivvVv TF IG oe", "Catania is the second largest city on which Mediterranean island?": "Sicily", "Which NFL player joined the Detroit Lions from the Miami Dolphins in 2013?": "Regaie Bush", "Which flamboyant golfer is known to eat volcanic dust?": "Jesper Parnevik", "What do you hit with a badminton racket? A": "MITIULLICUYUUN", "Who was the winning driver on the 1962 Daytona 500 race?": "Fireball Roberts", "Guinness is a famous drink from which city?": "Dublin", "What is the northernmost capital in the world?": "Reykjavik", "Which of these is a species of snake? A": "Mut", "What is an on-screen display listing available options or functions?": "Menu", "What is a group of crows called? A": "A murder", "What is it in metals that make them good conductors?": "Free Electrons", "In what city did the Jazz player prior to Salt Lake City, Utah?": "New Orleans", "How many pennies were in a British pré-decimal pound?": "240", "How many columns are there in a standard layout?": "18", "Which musician released 'Suspicious Minds’ in 1969?": "Elvis Presley", "Put these members of the British Royal Family in age order, oldest first.": "The Queen", "In which century is the 2013 movie Elysium’ set?": "22nd", "What is the state abbreviation for Nebraska?": "NE", "Which of these cities is in the Mojave Desert?": "Las Vegas", "Which English county is abbreviated to Oxon?": "Oxfordshire", "How many states are there in the contiguous USA (i.e. the 'Lower States’)": "48", "What does the Red flag mean in NASCAR racing?": "Stop the race immediately", "Which of these UK cities lies furthest west?": "Wolverhampton", "Which of these states shares a border with New York State?": "Pennsylvania", "Complete the title of a 2013 Pitbull release Feel This...'?": "Moment", "In what position in the batting order does ‘the clean-up’ hitter bat in baseball?": "Ath", "Galileo is known as the father of what? A": "Inv", "What two countries border Sweden and Russia?": "Finland and Norway", "Where did the New Jersey Devils relocate from in 1982?": "Colorado", "What does the 'M' in MLB stand for? A": "Major", "In which sport might a competing team put ina ‘power ten' to gain an advantage?": "Rowina", "What is the official language of North Korea?": "", "Who is only person to win the men's singles title at Wimbledon as a wildcard?": "Goran Ivanisevic", "Who said \"If a lie is told in the White house Nixon gets a royalty\"?": "Richard Nixon", "In his 19 year NBA career how many MVP awards did John Stockton receive?": "", "New York is also known as \"The Big ?.\" what?": "Apple", "Which of these is not a source of electrical energy?": "Plants", "Produced in Brazil, what is ‘cachaca’? A": "", "Cn is the symbol of which radioactive synthetic element?": "Copernicium", "How many muscles do you use when you frown?": "43", "Which film won the Academy Award for Best Picture’ in 1997?": "Titanic", "Where would you find your tibia? A": "Leg", "Which country's team remained undefeated in field hockey between 1928 and 1956?": "India", "Who was the partner of Stanislas Wawrinka in: in 2008 Olympics which they": "", "Which animals are associated with Gibraltar?": "Barbary macaque", "Who invented basketball? A": "James Naismith", "Where are the 'Doldrums' to be found? A": "", "In which country does the club Newell's Old Boys play?": "Argentina", "In 1984, who had the most number of assists in an All Star game?": "Magic Johnson", "Who sang ‘Like a Rolling Stone’? A": "Bob Dylan", "Where on the body is the humerus bone? A": "FNGTTE", "What is measured in jansky? A": "The strength of radio wave", "The Cook Islands belong to which country? A": "ING VY 2 CGilu", "What is neurypnology the study of? A": "Hypnotism", "Which H is the Greek Goddess of youth? A": "Vue", "Which Dutch explorer visited Australia and New Zealand in 1642?": "Abel Tasman", "What kind of money did Kip Moore sing about in his 2012 country hit?": "Beer Money", "Which chemical element is named after the formulator of the Theory of Relativity?": "Einsteinium", "Where is the southernmost point of the 50 US states?": "Hawaii", "If you are from Cyprus you are known as what?": "Cypriot", "Which of these is Portugal's capital city? A": "LIONVII", "How many noble gases occur naturally? A": "", "Who was the first fighter to go the distance with Marvelous Me Marvin Haggler in a ee ee an": "", "How many hoops are used in the British version of lawn croquet?": "", "What does a belonophobic fear? A": "Needles", "Lothar Matthdus won 150 international caps for which country?": "Germany", "Which of these Spice Girls once did a duet with Bryan Adams?": "Mel C", "What is the state abbreviation for Delaware?": "DE", "The first action the assistant referee makes after an offside decision is to?": "Raise his flag", "What other word could you use to describe luminosity?": "Brightness", "Magic Johnson spent how many years of his1 7 year NBA career at La Lakers?": "17", "What is a Pink Fir Apple? A": "Potato", "Which of the following coaches has more victories than Don Nelson?": "None Listed", "Who was the director of The Thin Red Line?": "Terrence Malick", "Orange County is located in which US State?": "California", "Who is the number one player in NBA history for blocks?": "Hakeem Olaiuwon", "The public information series ‘Protect and Sutvive' was produced to inform British fF ig a el tl": "", "Richard Nixon signed which act in December 1970?": "", "What is the name of the translucent and flavourless substance derived from animal _ a ry": "", "What is a mature swine called? A": "Hog", "Guerlain Meteorite Pearls are applied to which part of the body?": "Face", "Which state highest point is Mount Cheaha?": "Alabama", "The aurora borealis is better known as what?": "Northern Lights", "Where in Wales is the Dylan Thomas Centre?": "Swansea", "While sleeping, how often do cats purr?": "priwy euVeiiet", "What is David Bowie's real surname? A": "Jones", "Which of these is NOT a moon of Jupiter? A": "! MUrvlPv oe", "The State of Connecticut is named after what?": "River", "What do the Rockies become in South America?": "Andes", "What colour are the stars on the Chinese flag?": "Yellow", "Which statement about transformers is cofrect?": "AC", "What colour are dried vanilla pods? A": "Black", "The New York Yankees are based in which part of New York City?": "The Bronx", "What is a ‘caribou’? A": "Deer", "Complete the title of the 2015 film: 'Beasts of/No__": "Nation", "Which of these words means the opposite of (munificence’?": "Selfishness", "Who played Blofeld in the 2015 James Bond film ‘Spectre’?": "Christoph Waltz", "Which of these cricket grounds is in London?": "", "In which country was the Rosetta stone found?": "Eavot", "On a clock face, which number is directly opposite 9?": "", "What is geoponics the study of? A": "Agriculture", "Which of these trees is the smallest? A": "MMVIIVU Venue", "What three colors are on the flag of Pahama?": "Red, white and blue", "Which month's flower is the carnation? A": "yvaruary", "Which of the following is made by bees? A": "PIVilwy", "Which city is home to the Hermitage Museum?": "St. Petersburg", "Liposuction removes which of the following from the body?": "Fat", "Which is the only borough of New York City that is on the mainland?": "The Bronx", "Which monster in ‘Monsters, Inc.’ is blue and furry?": "Sulley", "What is another name for the wildebeest? A": "Niu", "Which of the following is not a mammal? A": "", "Which Briton became 800 meters champion at the 1980 Olympics?": "Steve Ovett", "Starting with the largest, put these world famous lakes in size order.": "Michigan", "Which of these is not a mountain in Alaska?": "Mount Fiji", "What is measured in poise? A": "", "How deep is one fathom of water? A": "1.82 meters (6 feet)", "Which Disney princess was the daughter of King Triton?": "The Little Mermaid", "Which of these cities is located in Belgium?": "Brussels", "Which word can go after 'china ... and b re’. .. pigeon’ to make a common": "", "Sunrise to sunset is known as a what? A": "", "Pb is the symbol for which group 14 element?": "Lead", "Which of these was a member of The Beatles?": "George Harrison", "On which island in New York would you find the Statue of Liberty?": "Liberty Island", "What CAN'T cats do? A": "Climb head first down a tree", "Which NFL player joined the Seattle Seahawks from the Minnesota Vikings in A | ANnanny": "a es es pe", "What kind of animal is Fievel in \"An American Tail\"?": "A Mouse", "Another name for your voice box is the what?": "Larynx", "What is the name of Europe's longest river? A": "priwe vty", "Usain Bolt has represented which Caribbean country at the Olympic games?": "Jamaica", "Prince Henry, known as The Navigator, was from which country?": "Portugal", "What is it called when a person dribbles with both hands at the same time?": "Double Dribble", "How would you describe a fox's ears? A": "Bevel, PHIGIyUlar Lalo", "What is the elemental symbol of Neon? A": "ING", "What is done to remove the leafy parts of fruit such as strawberries?": "Hull", "In which Dutch city are the famous Ajax club based?": "Amsterdam", "Which team did the Kansas City Royals d at to win the 1985 baseball world _ Ff": "", "What is Eric Clapton's nickname? A": "Slow Hand", "Heather Watson won a gold medal at the 2008 Commonwealth Young Games in Lf Ltn": "", "Xoom is an Android-based tablet computer produced by what company?": "Motorola", "A snickerdoodle is made with which of the following ingredients?": "Cinnamon", "Silicon Valley is located in what U.S. state? A": "VGHIVITIG a", "What is a Grand Slam plus an Olympic tennis gold in the same year called?": "Golden Slam", "Which American city was once called New Amsterdam?": "New York", "What is the official website of NASCAR? A": "WV VV VV .FIQOUGI.UVITT", "What chemical symbol does silver have? A": "", "In what year did London win the bid to host the 201 2 Olympics?": "2005", "How many spices are mixed in allspice?": "", "What is another name for 0 degrees latitude?": "The Equator", "What future movie star did the voice of Anastasia as akid in ‘Anastasia’?": "Kirsten Dunst", "Who had a bird for their surname and a city for.their first name?": "Florence Nightingale", "What is the nickname of the Duke basketball team?": "Blue Devils", "What is the venue for the Australian Open? A": "IVICINVUITIO FT GIN", "What colour were the Clangers? A": "Pink", "Rickrolling is one of the most widespread internet memes of all times. What artist | ep se lh Ulm lt": "", "What nationality are The Corrs? A": "Coventry", "Leicester is a city in what European country?": "Enaland", "How many US states have a Pacific coastline?": "", "Fluoride is found in which part of the body? A": "WVIICSO", "Where in the UK is the Wolf Rock lighthouse?": "Scilly Isles", "What is located in the middle of the arm? A": "bIVUYY", "Which of these temperatures occurs on Mercury?": "", "The name of what character is used to describe a fantasist?": "", "The state abbreviation for Hawaii is what? A": "", "What is a dog's most powerful sense? A": "VITICI", "Who plays the role of Seth in the TV show The 0.C/?": "Adam Brody", "Nicholas Nemeth is the real name of which cufrent WWE superstar?": "Dolph Ziggler", "In 1976, who became the first gymnast to score a perfect 10?": "Nadia Comaneci", "Which animal grunts? A": "", "How much does a cubic meter of water weigh?": "One tone", "Which current NBA franchise have been champions the most times?": "Boston Celtics", "Which of these is not found in the Earth's atmosphere?": "Gold", "How many world series have the Cincinnati Reds won?": "", "What's the legal first name of Egyptian sitiger Hesham Abbas?": "Mohamed", "What A is the most western state in America?": "Alaska", "What US states represented by the initials IAN": "lowa", "What is a blue moon? A": "The second full moon in one", "Which country does not border Luxembourg?": "Switzerland", "The Seychelles are in which body of water? A": "TEIMIa WUeail", "What is the state capital of North Carolina? A": "INGE", "What is the color of a tennis ball? A": "Yellow", "Which animal trumpets? A": "", "Which of these is used to measure length? A": "INUIT O", "Which country won the first female Olympic soccer competition in 1996?": "USA", "Which continent has the highest population?": "Asia", "Which of these is a musical style originating from Cameroon?": "Bikutsi", "What is the 'Mohs Scale’ used to measure? A": "PIarpuUrinvosvo", "Which show is the story of Selina Meyer aiming to become President?": "Veep", "Who directed the 2013 movie Oz the Great and Powerful?": "Sam Raimi", "Timbaland had a 2010 hit with....? A": "Carry Out", "In which year was Madonna born? A": "Creed", "What is Ozzy Osborne's wife called? A": "Sharon", "Who starred with Steve Carell in the movie Date Night?": "Tina Fey", "Which of these is a famous singer? A": "Rod Stewart", "Which lis a group from America? A": "Isley Brothers", "When did Kylie have her first No.1? A": "1988", "Michael Fassbender played which Shakespearian character in a 2015 film?": "Macbeth", "What color was Mater from 'Cars' originally?": "Baby Blue", "When did Nsync release ‘Celebrity’? A": "2001", "Which role was not played by Peter Sellers inthe film Dr. Strangelove?": "Gen. Jack D Ripper", "Friends was created by Marta Kauffman and who?": "David Crane", "Who voiced Norman's Uncle Prenderghast in ‘ParaNorman’?": "John Goodman", "Which comedy was set in the fictional 99th precinct of the NYPD?": "Brooklyn Nine Nine", "Who sang the song 'Night Moves’? A": "Bob Segar", "Who voiced Victor Van Dort in \"Corpse Bride\"?": "Johnny Depp", "Which cartoonist created Woody Woodpecker?": "Walter Lanz", "Which B is a band from the USA? A": "Don McLean", "Who was first to quit the Animals? A": "Alan Price", "Which actress stars in the 1999 movie, ‘Lake Placid’?": "Bridget Fonda", "What is rock star Neil's last name? A": "Diamond", "Which year did MTV make it's debut? A": "1981", "Who wrote the song Father & Son? A": "Cat Stevens", "What is the name of Bob Parrs wife in The In¢redibles?": "Helen", "Quentin Tarantino released which post-Civil War epic in 2015?": "The Hateful Eight", "Who played the role of Sylar in the TV show ‘Heroes’?": "Zachary Quinto", "Which Michael is R.E.M.'s frontman? A": "Stipe", "Which of these is the name of a board game?": "Sorry!", "How many keys are there on a piano? A": "88", "Who played the title role in the 2001 movie adaptation of Bridget Jones' Diary?": "Renée Zellweger", "Justin Hawkins fronted which band? A": "The Darkness", "Which film won the Academy Award for Best Picture’ in 2005?": "Crash", "Which former Spice Girl set up the coinpany Red Girl Records?": "Mel C", "Who released the 2000 album 'Play'? A": "Moby", "Which Monkee was the voice of Scooby Doo?": "Micky Dolenz", "Which of these is the name of a Pixar movie?": "Up", "What is the highest number on a Roulette wheel?": "36", "Who was the director of Toy Story? A": "John Lasseter", "Who wrote ‘Islands in the Stream’? A": "Bee Gees", "Finish the title of Manu Chao's 1998 song: King of -": "Bongo", "Jimmy Nail sang about '... Shoes’? A": "Crocodile", "In what was Pixar originally founded as a company?": "1979", "The 2013 movie ‘Frozen’ was inspired by which Hans Christian Andersen's fairy tale?": "The Snow Queen", "Who played the US President in the film Dr Strangelove?": "Peter Sellers", "Who was the director of There Will Be Blood?": "Paul Thomas Anderson", "Father Francis Mulcahy is from which TV show?": "Mash", "Who provided the voice of Dracula in \"Hotel Transylvania\"?": "Adam Sandler", "What talk show host voiced Gobber the Belch in \"How to Train Your Dragon\"?": "Craig Ferguson", "Who directed the 2013 movie 'The Hobbit: The Desolation of Smaug'?": "Peter Jackson", "Which of these animated series was NOT created by Mike Judge?": "Family Guy", "Who did the voice of Rocky in \"Chicken Run\"?": "Mel Gibson", "What breed of dog is the cartoon character Pluto?": "Bloodhound", "In what year were the Furby toys first released?": "1998", "Name the toy. Red outer case with two buttons?": "Etch a Sketch", "Which singer's surname is Ciccone? A": "Madonna", "What breed of dog is Scooby Doo? A": "Great Dane", "What sort of films did Will Hay appear in back in the '30s and '40s?": "Comedy", "Eva Longoria stars in which hit US TV sefies?": "Desperate Housewives", "Complete the title of Steven Spielberg’ Ss 2015 release: ‘Bridge of .": "Spies", "Which city are the band Oasis from? A": "Manchester", "How many \"...Weddings And A Funeral\" in the hit movie?": "Four", "What does Gru want to steal in 'Despicable Me?": "The Moon", "Which Beatle was born in India? A": "1970", "Which M is not an American artist? A": "Morrissey", "Which word is missing from the David Bowie hit: 'Space ..'?": "Oddity", "What kind of '... Touch’ did Bruce Springsteen have in 1992?": "Human", "Which orchestral instrument is also called the octave flute?": "Piccolo", "What is Maxi Priest's real surname? A": "Elliott", "WC Boggs is a character from which Carry Omfilm?": "At Your Convenience", "Who was the director of 'The Hunger Games’?": "Gary Ross", "How old was Cliff Richard in 2000? A": "60", "Randy Meisner was a member of which band?": "Eagles", "What's the name of the clown in The Simpsons?": "Krusty", "In the Disney movie, Cinderella had slippers made of what?": "Glass", "Finish the band name: Cheap . A": "Trick", "What type of creature is the comic character Marmaduke?": "Dog", "Which of these TV shows had a character called Ted Mosby?": "How | Met Your Mother", "What western town does Rango wander into in \"Rango'?": "Dirt", "In which city is Mad Men set? A": "New York", "Which of these was The Prodigy's first Top 10)hit in the UK?": "Charly", "What is the fictional London Borough in EastEnders’?": "Walford", "Who was the runner-up of Season 1 of American Idol'?": "Justin Guarini", "Which Jackson is not from the USA? A": "Joe Jackson", "What music genre is most often associated with Paul Van Dyk?": "Trance", "Who wrote UB40's 'Red Red Wine’? A": "Neil Diamond", "Who played the title role in the film ‘Thor: The Dark World’?": "Chris Hemsworth", "Who recorded the album ‘True Blue’ A": "Madonna", "Which of these is the sixth instalment in the X-Men film series, released in 2013?": "The Wolverine", "Which group had 2 of the 5 biggest hits of the year in 1979?": "Blondie", "Which singer played Catwoman in the Batman TV series?": "Eartha Kitt", "The song ‘American Woman is by which band?": "The Guess Who", "Who is The Who's lead guitarist? A": "Pete Townshend", "Who lost a glass slipper at the ball in a Disney movie?": "Cinderella", "Who originally recorded ‘Sorrow’, a 70s hit forDavid Bowie?": "Merseys", "Who sang about an 'Uptown Girl’? A": "Billy Joel", "Finish the band name: Sigur A": "R??s", "What record label is Beyonce with? A": "Columbia", "In which city is 'One Hundred and One Dalmatians’ set?": "London", "What is David Essex's real surname? A": "Cook", "Which of these was a sequel released in December 2013?": "Anchorman 2", "The Black Swann featured in which British Soap Opera?": "Family Affairs", "Who was the director of Chicago? A": "Rob Marshall", "Will Ferrell starred in which 2015 comedy romp?": "Get Hard", "What nationality are Daft Punk? A": "Pete Best", "Complete the title of the 2015 film: 'The Fotbidden ___": "Room", "The movie \"Coraline\" is based on a story by what fantasy author?": "Neil Gaiman", "Dakota Johnson and Jamie Dornan played in which raunchy 2015 film release?": "Fifty Shades of Grey", "Who directed the movie 'WALL-E'? A": "Andrew Stanton", "Which lead actor played Owen in the 2015 release of ‘Jurassic World'?": "Chris Pratt", "Who made the album, The Blueprint? A": "Jay-Z", "Vincent Kartheiser plays the role of who in Mad Men?": "Pete Campbell", "Muhammed Ali retired in which year? A": "1981", "In which city did Jimi Hendrix die? A": "London", "At the 2001 Primetime Emmy Awards, who won Best Actor for Will & Grace?": "Eric McCormack", "What is the name of Woody Woodpecker's nephew?": "Knothead", "Who stars as the female lead in 50 First Dates?": "Drew Barrymore", "What relation are Joe and Jack Sugden in ‘Emmerdale’?": "Brothers", "Who played the Comedian in Watchmen?": "Jeffrey Dean Morgan", "In The Simpsons, what is the name of Ned Flanders’ late wife?": "Maude", "Fill in the blanks of a famous Walter Scott work \"__ of Geierstein.": "Anne", "Ronald Wolfe and Ronald Chesney created which series?": "On the Buses", "The 2013 movie 'Don Jon’ is what sort of movie?": "Romantic Comedy", "Who played the male lead in the 2013 film ‘Gravity’?": "George Clooney", "Who is the lead singer of Queen? A": "Freddie Mercury", "Mickey Mouse started life with another naine, what was it?": "Mortimer", "Which cartoon features Peter, Lois, Brian and Stewie?": "Family Guy", "Which of these was a popular type of music during the 1940s?": "Swing", "Finding Dory is a sequel to which animated film?": "Finding Nemo", "Which of these U2 hits came from the Rattle and Hum' album?": "Desire", "Bugs Bunny was a caricature of which actor?": "Clark Gable", "What is Pink's real first name? A": "Bob Marley", "Of these, which was a popular animated sefies which began in 1993?": "Rocko's Modern Life", "Who was considered to voice Audrey 2 in Little Shop of Horrors?": "Eddie Murphy", "Who had a ‘Teenage Dream’ in 2010? A": "Katy Perry", "What was the name of Ron Burgundy's dog in Anchorman?": "Baxter", "Don Adams and Barbara Feldon star in which TV series?": "Get Smart", "gle Play and vice could help": "", "What is Billy Idol's real surname? A": "Broad", "Which country is singer Bjork from? A": "Iceland", "Who directed the film ‘Breakfast at Tiffany's?": "Blake Edwards", "Whose real name is Orville Burrell? A": "Shaggy", "Where were Ten Years After formed? A": "Nottingham", "Who created the TV show which ‘Homeland’ is based on?": "Gideo Raff", "In which Carry On film did Jim Dale appear as/Marshall P. Knutt?": "Carry On Cowboy", "Which of these films was released in 3D in April 2013?": "Jurassic Park", "Who was the director of Shakespeare in Love?": "John Madden", "What is the surname of the Glasgow-born folk singer Donovan?": "Leitch", "Which girl was not a Beatles song? A": "Victoria", "Who did the voice of Princess Fiona in \"Shrek\"?": "Cameron Diaz", "Which character does Michael Shannon in the 2013 movie Man of Steel?": "General Zod", "In ‘The Dukes of Hazzard’, in whose pants did, Marcy lose her wedding ring?": "Al", "Which Don sang about 'Vincent'? A": "1981", "In what city is the TV series 'Sex and the City’ set?": "New York", "Princess Jasmine was a character in which animated film?": "Aladdin", "Who directed 'Star Wars: The Force Awakens?": "J.J. Abrams", "What is British singer-songwriter Polly 'PJ' Jean's surname?": "Harvey", "Who is the frontman of Madness? A": "Richard", "Who made the album London Calling? A": "The Clash", "On whose life was the CW TV sitcom ‘All of Us\\based?": "Will Smith", "The Mousekewitzs from \"An American Tail\" come from what country?": "Russia", "Freddie Mercury died in which year? A": "1991", "Which of these is a favourite saying of Bart Simpson?": "Eat my shorts", "Finish the title of Depeche Mode's song: Enjoy the ‘": "Silence", "What villain threatens the entire Lego universe in \"The Lego Movie\"?": "Lord Business", "Which national daily newspaper featured Giles cartoons?": "Express", "In the TV cartoon, who drove ‘Ivor the Engine’?": "Jones the Steam", "How many dwarf friends did Snow White have?": "", "In which film does Mickey Mouse become the Sorcerer's Apprentice?": "Fantasia", "Finish the band name: Yo La A": "Tengo", "In which year did Cher turn 40? A": "Drake", "What is the name of Bart's best friend in The Simpsons?": "Milhouse", "Whose real surname is Zimmerman? A": "Bob Dylan", "Finish the name of the British indie rock band: Bloc .": "Party", "The movie poster tag line for which animated film was ‘Escape or Die Frying’?": "Chicken Run", "What colour is the ogre 'Shrek' ? A": "Green", "What is the alien-like device of Ben Tefnyson called?": "Omnitrix", "What is Cheryl Cole's maiden name? A": "Tweedy", "Aaron Hotchner is a main character in which hit show?": "Criminal Minds", "Tchaikovsky died of which disease? A": "Typhoid", "Which group was introduced by Peter Kay at/Live 8 in London?": "The Who", "Who was 'the boy who never grew up' ina Disney movie?": "Peter Pan", "Where in Wales was Tom Jones born? A": "Pontypridd", "Who featured on Rihanna's 2007 chart topping hit 'Umbrella'?": "Jay-Z", "What sort of creature is Alex in ‘Madagascar’?": "Lion", "Who had a 2012 hit with 'Diamonds'? A": "Rihanna", "Who joined The Supremes in 1967? A": "Cindy Birdsong", "Who is the king of Halloween town in \"The Nightmare Before Christmas\"?": "Jack Skellington", "In ‘Breaking Bad’, what is Walter Whites middle name?": "Hartwell", "Which cartoon mouse is perennially chased by Tom?": "Jerry", "Which duo were brother and sister? A": "Carpenters", "In what year did The Sopranos end its original run?": "2007", "Rene Artois is the leading character in which sitcom?": "Allo Allo", "Bomb Voyage was a character in which animated film?": "The Incredibles", "Who directed 'The Sound of Music’? A": "Robert Wise", "What is Drake's Twitter handle? A": "Woodward", "What was the name of the crocodile in Disney's Peter Pan?": "Tick Tock", "Who was the director of ‘Titanic’? A": "James Cameron", "What family does the sitcom Everybody Loves Raymond revolve around?": "The Barones", "Which Disney movie are Milo and Kida from?": "Atlantis: The Lost Empire", "In which city did Pink Floyd form? A": "Cambridge", "How long is Gene Simmons' tongue? A": "5 inches", "Who was the director of Crash? A": "Paul Haggis", "How many toes does Bugs Bunny have on each foot?": "Three", "Phil Redmond was the creator of which of these soaps?": "Brookside", "What is Tori Amos' real first name? A": "Myra", "Which of these Brad Pitt films was not released in 1991?": "Kalifornia", "Which comedian played the title role in Unicle Buck?": "John Candy", "In what year was Robin Thicke born? A": "1977", "John Smith is a character in which animated film?": "Pocahontas", "Who was Olive Oyl's boyfriend before Popeye?": "Ham Gravy", "By which name is Alecia Moore better known?": "Pink", "Who is Lorna Luft's singer sister? A": "Liza Minnelli", "Who asked 'What's My Name' in 2011? A": "Rihanna", "Iggy Azalea is what kind of singer?": "Rapper", "Who directed Matt Damon in the 2015 epic The Martian’?": "Ridley Scott", "The sitcom starring John Goodman as Dan Connor was Called what?": "Roseanne", "What is R&B singer Usher's surname? A": "Raymond", "In what year did Mad Men first air? A": "2007", "Which Robin played Mrs Doubtfire on the big screen?": "Williams", "In what year did Disney release \"The Little Mermaid\"?": "1989", "How many dalmatians was Cruella DeVille hoping to acquire?": "101", "Dash was a character in which animated film?": "The Incredibles", "Who played the male lead in the 1999 film Notting Hill?": "Hugh Grant", "What's the name of Donald Duck's girlfriend?": "Daisy", "Who performs the opening theme for Orange Is the New Black?": "Regina Spektor", "What was the last name of American-born Greek soprano Maria?": "Callas", "Beyoncé is married to which rapper? A": "Jay-Z", "Who was the director of Lost in Translation?": "Sofia Coppola", "In which decade did Herge's Tintin cartoon character first appear?": "1920s", "Who played the part of Miranda in 'Sex and the City?": "Cynthia Nixon", "Who do the monsters in ‘Monsters, Inc.’ scare?": "Children", "How is John Leeson better known to Doctor Who fans?": "Voice of K9", "Where was singer Toni Braxton born? A": "USA", "Who backed Kid Creole in the '80s? A": "The Coconuts", "In which century is the film ‘Pocahontas’ set?": "17th", "What colour was Katy Perry's hair in the ‘Wide Awake’ video?": "Purple", "What were The Kinks once known as? A": "The Ravens", "The short lived Friends spin off featuring Mp Tribbiani was Called?": "Joey", "In 1999, which artist released the UK number 1 album ‘Hush’?": "Texas", "The song 'Maggie May' was by which artist?": "Rod Stewart", "Which teen actor skipped school in the film, \"Ferris Bueller's Day Off\"?": "Matthew Broderick", "In the world of animation, who is Bam Bain's father?": "Barney Rubble", "Which TV personality's catchphrase is You're fired'?": "Alan Sugar", "In the Howard The Duck movie, what does Howard smoke?": "Cigars", "\"How to Train Your Dragon\" is based on a sefies of children's books by what author?": "Cressida Cowell", "In the 1980s, mad Lizzie Webb found fame presenting what on 'TV-am’?": "Exercise routines", "Who was the director of Milk? A": "Gus Van Sant", "Who were 'The Invisible Band’ on their second album in 2001?": "Travis", "What animated movie features the song ‘Everything is Awesome\"?": "The Lego Movie", "Who won the Golden Globe for Best Actress - Television Comedy in 2009?": "Toni Collette", "Who was the director of Life of Pi? A": "Ang Lee", "Paula Abdul was born in which year? A": "1962", "Who was the voice of the Fairy Godmother in ‘Shrek 2?": "Jennifer Saunders", "Will Smith played a conman in which 2015 film release?": "Focus", "Which TV Superman played the lead Role in Futursport?": "Dean Caine", "Whom did Harry meet in the film with Billy Crystal?": "Sally", "Jessie Wallace plays which character in EastEnders’?": "Kat Slater", "Which actor starred in both X-Files and Twin Peaks'?": "David Duchovny", "Which artist opened Woodstock? A": "Richie Havens", "Which of these bands infamously smashed guitars up on stage?": "The Who", "Who was 'Sorry' according to the title of he, 2006 No.1 hit?": "Madonna", "Who played the first Dr Who?": "William Hartnell", "Which US state is the TV show, 'The Walton's’ set in?": "Virginia", "From 1997, which of these became a popular show for young children?": "Teletubbies", "Which city was a hit for Ultravox? A": "Vienna", "In what year did the final episode of The West Wing air in the US?": "2006", "In 'The Big Bang Theory’, how many episodes are there season 6?": "24", "Who played the female lead in the 2013 film ‘Gravity’?": "Sandra Bullock", "Grey Brother is a character in which animated film?": "The Jungle Book", "Who was the director of 'Good Night, and Good Luck'?": "George Clooney", "Complete this famous Morrisey track, Everyday is like__'.": "Sunday", "How old was Elvis when he died? A": "Kour", "Which TV show won the Emmy Award for Outstanding Main Title Design in 2007?": "Dexter", "Which animal was a hit for Fleetwood Mac?": "Albatross", "Which instrument would you associate with Jelly Roll Morton?": "Piano", "Who did the voice of Mr. Fox's wife in Fantastic Mr. Fox\"?": "Meryl Streep", "Jiminy Cricket is a character in which animated film?": "Pinocchio", "Which 2003 movie was about a clownfish called Marlin?": "Finding Nemo", "Rob Letterman directed Jack Black in which 2015 kids film?": "Goosebumps", "Who was the director of ‘Inglorious Basterds'?": "Quentin Tarantino", "Who is ‘Siouxsie’ associated with? A": "The Banshees", "Who played Elle in the movie \"Legally Blonde\"?": "Reese Witherspoon", "In ‘The Jungle Book’, what animal was Baloo?": "Bear", "The Beatles are from which country? A": "England", "Who starred in the animated comedy \"8 Crazy Nights\"?": "Adam Sandler", "If music was to be played ‘leggiero’, how should it be done?": "Lightly", "Who was the voice of Flik in the movie 'A Bug's Life'?": "Dave Foley", "\"Puss in Boots\" is a spinoff of what animated movie?": "Shrek", "Animated TV show South Park is set in which US state?": "colourado", "Who was the director of The King's Speech?": "Tom Hooper", "In what year was Taylor Swift born? A": "1989", "Amy Poehler and Tina Fey starred in which 2015 comedy classic?": "Sisters", "What is Mary J Blige's middle name? A": "Jane", "Johnny Depp starred in which of these 2013 movies?": "The Lone Ranger", "June Brown famously plays which role in EastEnders’?": "Dot Cotton", "What was the number of the 'Fast and Fufious' film released in 2013?": "", "Of these, which was a TV show which began in 1991?": "Step By Step", "The film, Pretty Woman, is set in which city?": "Los Angeles", "In which year was Beyonce born? A": "Irish", "When was ‘Toy Story 3' released? A": "2010", "Who had a UK No.1 with ‘Fernando’ ? A": "Abba", "Which of the following played WC Boggs in Canry On At Your Convenience?": "Kenneth Williams", "Which pop group had a one-armed drummer?": "Def Leppard", "Who falls in love with Diane Keaton in Aninie Hall?": "Woody Allen", "What type of cartoon animal was parsley in The Herbs?": "Lion", "What is the name of the main character of the TV show Mad Men?": "Don Draper", "Who sang the song 'Rebel Rebel’? A": "David Bowie", "What world does the door take Coraline to in Coraline\"?": "The Other World", "Who is the lead singer of Keane? A": "Tom Chaplin", "Which of these Pixar movies is about a robot?": "WALL-E", "What bat serves as the henchman for Rasputin in \"Anastasia\"?": "Bartok", "How many seasons of My Super Sweet Sixteen were there?": "", "What is Hank Marvin's real name? A": "Brian Rankin", "What year was John Lennon born? A": "Tipsy", "Care Bears were created by which company?": "American Greetings", "Which E is a group from the States? A": "Eagles", "Christian Bale starred in which 2015 biopic?": "The Big Short", "Who was lead singer of The Smiths? A": "Morrissey", "Quagmire is a main character in which show?": "Family Guy", "Which of these is the name of an outdoor toy?": "Jump Rope", "What sort of character is Marty in ‘Madagascar’?": "Zebra", "Which animated TV show features the catchphrase ‘Yabba dabba doo!'?": "The Flintstones", "A pair of poor flatmates is the storyline for which sitcom?": "2 Broke Girls", "What country are My Bloody Valentine from?": "Ireland", "What is Queen Latifah's real name? A": "Dana Owens", "Danny Boyle directed Michael Fassbender in which 2015 biopic?": "Steve Jobs", "Who held the record for the most money ever won on a game show until 2005?": "Ken Jennings", "Which of these horror films was released in January 2013?": "Texas Chainsaw 3D", "What was a hit for the Rubettes? A": "Sugar Baby Love", "Which actor produced the 2007 movie ‘J uno ?": "John Malkovich", "What were the first names of 20th century animators Hanna and Barbera?": "William and Joseph", "Complete title of this 1988 Michael Jackson single: ‘Dirty?’": "Diana", "What was Kurt Cobain's middle name? A": "Donald", "Charlie Fairhead is a character from which TV series?": "Casualty", "What was the name of the police officer in Top Cat'?": "Officer Dibble", "Which member of the Python team played the title role in the Life of Brian?": "Graham Chapman", "The 90s toy 2-XL was what? A": "A Robot", "Finding Nemo’ won an Academy Award for what?": "Best Animated Film", "Which of these films was released in 3D in February 2013?": "Top Gun", "Which sitcom is narrated by main female character Frankie Heck?": "The Middle", "Elastigirl was a character in which animated film?": "The Incredibles", "Where is ‘Ratatouille’ mainly set? A": "A resturant", "Which of these is the name of a playground toy?": "Jacks", "Who wrote the song ‘Father & Son’? A": "Cat Stevens", "Which musician organized Live Aid? A": "Bob Geldof", "Who was the voice of Smurfette in the 2013 movie 'The Smurfs 2'?": "Katy Perry", "Where were The Stone Roses formed? A": "Manchester", "Which singer had a 2008 hit with the song If Were A Boy’?": "Beyonce", "Which band sang ‘Breaking the Law’? A": "Judas Priest", "Who directed the film ‘Unforgiven’? A": "Clint Eastwood", "Who wrote 'I Shot The Sheriff‘? A": "1986", "Who is the lead singer of The Who? A": "Roger Daltrey", "Name the show that made The Fonz a cult heto?": "Happy Days", "Who was the director of No Country for Old Men?": "Joel and Ethan Coen", "Who composed the Sinead O'Connor hit nothing Compares 2 U'?": "Prince", "Which Disney film features a cat called ‘Sergeant Tibbs'?": "101 Dalmations", "Who is 'King of Oriental Rock'? A": "Blondie", "Who plays Phoebe Buffay in the popular siteom Friends?": "Lisa Kudrow", "Which movie that was released earlier than the others?": "Big", "Where was the great director Frank Capra botn?": "Sicily", "Tim Allan loves hunting, shooting and fishing in which comedy?": "Outdoor Man", "Which cartoon show popularized the phtjase Oh my God, they killed Kenny!?": "South Park", "Who is the lead singer of Chicago? A": "Peter Cetera", "In what year was Chris Brown born? A": "1989", "The movie \"Fritz the Cat\" is based on the work of what comic artist?": "R. Crumb", "Who was the only non-Swede in Abba? A": "Frida", "What celebrity chef made a voice cameo as/Rabbit the chef in \"Fantastic Mr. Fox\"?": "Mario Batali", "Who trains the Furious Five in \"Kung Fu Panda\"?": "Shifu", "Which group had 2 of the 5 biggest hits of the year in 1978?": "Boney M", "Who released Creep in 1993? A": "Radiohead", "Marty Pellow fronted which band? A": "Wet Wet Wet", "Tom in Tom and Jerry was originally named what?": "Jasper", "What Monty Python member voiced King Harold in \"Shrek 2\"?": "John Cleese", "In ‘Family Guy’, what's the name of the chick flick that Peter directed?": "Steel Vaginas", "Who made the album, Rubber Soul? A": "The Beatles", "Who played Gretel in the 2013 movie Hansel & Gretel: Witch Hunters’?": "Gemma Arterton", "General Any Category Knowledge": "", "Scrat is a character in which animated film?": "Ice Age", "Who was the director of 'Traffic'? A": "Steven Soderbergh", "Who did the voice of Mumble in \"Happy Feet\"?": "Elijah Wood", "What is the name of the TV show in which each season covers 1 day?": "24", "Who falls in love with the Donkey in \"Shrek\"?": "The Dragon", "How many seasons of Buffy the Vampire Slayer were made?": "", "In which film did Fenella Fielding make her Canry On debut?": "Carry On Regardless", "Which singer's surname is Knowles? A": "Beyonce", "Which 2006 movie was about a dancing penguin?": "Happy Feet", "Carry On: Which of these Carry On films was released before the others?": "Sergeant", "Who was the director of Slumdog Millionaire?": "Danny Boyle", "Who is the Earth at war with in the 2013 movie ‘Pacific Rim'?": "Kaijus", "Flotsam is a character in which animated film?": "The Little Mermaid", "In which year was Pixar's 'WALL-E' released?": "2008", "Which Beatle said ‘I like Beethoven, especially the poems.’?": "Ringo", "Which of Top Cat's friends wears a white sweater?": "Choo Choo", "Which of these actors provided a voice for the film The Croods?": "Ryan Reynolds", "Which Disney film contains the song ‘Circle of Life’?": "The Lion King", "Heather Small fronted which group? A": "M People", "Algerian musician Souad Massy usually plays what instrument?": "Guitar", "In \"Ice Age,\" Scrat keeps chasing what food that always seems out of his reach?": "Nuts", "Which of these is the real band? A": "Black Sabbath", "Which of the following is the correct title of a Steps No.1?": "Stomp", "Who was the director of 'Black Hawk Down'?": "Ridley Scott", "Beautiful Monster was a hit song for which of/these artists?": "Ne-Yo", "Who is the bass player in Queen? A": "John Deacon", "Who portrayed Detective Andy Sipowicz on NYPD Blue’?": "Dennis Frankz", "Which U.S. state did R.Dean Taylor claim ‘Wants Me' in 1971?": "Indiana", "Which of these movies is a comedy? A": "Old School", "What w": "", "What record labelis Beyonce with? A": "Columbia", "What is Mary J Blige’s middle name? A": "Jane", "What 1994 movie was about a cub calle Simba?": "The Lion King", "Which of these bands infamously smash guitars up on stage?": "The Who", "Which of these is the name of a playgrou toy?": "Jacks", "Which lead actor played Owen in the 201 release of ‘Jurassic World'?": "Chris Pratt", "How would you categorize the film 'Texa Chainsaw Massacre’?": "Horror", "Who provided the voice of Dracula in \"Ho Transylvania\"?": "Adam Sandler", "In ‘The Dukes of Hazzard’, when Al is ins h pain n me je goes: to see Marcy's dentist, pF Po... gy. DT lly": "", "Who played the Comedian in Watchmen": "Jeffrey Dean Morgan", "Who plays drums in The Rolling Stones": "Charlie Watts", "Finding Nemo’ won an Academy Award f what?": "Best Animated Film", "Who was the only non-Swede in Abba’ A": "Frida", "Who voiced Vitruvius in \"The Lego Movi A": "IVIMIPYGGEE PT Peeriiael", "Which film shows Tom Cruise dancing in pink shirt and his underwear?": "Risky Business", "Which ca and like \\9Tmaking new friends\\92? on": "Hello Kitty", "What \"Simpsons\" actor did the voice of Bartok in the movie \"Anastasia\"?": "Hank Azaria", "What Massachusetts city serves as the setting for \"ParaNorman\"?": "Blithe Hollow", "What is Boy George's real surname? A": "O'Dowd", "Which Carry On regular took the lead role in the 90s revival Carry On Columbus?": "Jim Dale", "Fill in the blanks in the title of a famous EM Forster work \"A Room With a...\"?": "View", "Which of these bands is Swedish? A": "Cardigans", "Whe-was-the-directorofly": "", "Zazu is a character in which animated fil A": "Pe BIVeil WNIhYy", "Where was the great director Frank Capr botn?": "Sicily", "Who played the male lead in the 1999 fil Notting Hill?": "Hugh Grant", "Who asked 'What's My Name' in 20117 A": "Rihanna", "Carey Mulligan starred in which classic t fona 2015 film?": "Far from the Madding Crowd", "Optimus Prime is from which cartoon‘ A": "PIariviNMV! Viv", "What is the name of the TV show in whic each season covers 1 day?": "24", "In what movie is there a character name Thumper?": "Bambi", "Which legendary band released 'The Wa": "Pink Floyd", "Boo is a character in which animated fil A": "IVIMJETOLU TY, Tile oe", "Ruth Handler created which world famou toy?": "Barbie", "What is Charlie's profession in ‘Two and Half Men’?": "Jingle Writer", "Channing Tatum returned as which character in a sequel entitled 'XXL in 20157": "Maaic Mike", "Which Disney princess was the daughter King Triton?": "The Little Mermaid", "In what year did Disney release \"The Littl Mermaid\"?": "1989", "Who was the voice of Woody in 'Toy Sto A": "PMT? PIrQabine oe", "Which TV Superman played the lead Rol in Futursport?": "Dean Caine", "What were the first names of 20th centu animators Hanna and Barbera?": "William and Joseph", "Which cartoon character was ably assist by/Spot the Cat?": "Hong Kong Phooey", "What did Gilbert O'Sullivan ask in 19747 A": "any a any a any oe", "Charlie Fairhead is a character from whic TV series?": "Casualty", "Will Smith played a conman in which 201 film release?": "Focus", "Bono is lead singer of which rock group! A": "", "Complete the title of the Cat Stevens hit: Has Broken’?": "Morning", "Which of these featured on Chingys 200 hit'One Call Away’?": "J. Weav", "Allied Forces’ is an album by which grou A": "PPIOrript ee", "What does Gru want to steal in 'Despicab Me?": "The Moon", "Which band sang ‘Breaking the Law'? A": "Judas Priest", "What job does Charlie Brown's father d A": "WAGIVel", "Which member of the Python team playe the title role in the Life of Brian?": "Graham Chapman", "Which Carry On film had the tagline A gre guy with his chopper?": "Carry On Henry", "Which cast member left the 'Ghost Whisperer’ in 2006?": "Aisha Tyler", "Will Ferrell starred in which 2015 comed romp?": "Get Hard", "Complete the name of this hit US TV sho The Good": "Wife", "Who had a 'Teenage Dream’ in 2010? A": "Katy Perry", "Who gets Springfield stuck under a dom in‘The Simpsons Movie\"?": "Homer", "Kaa is a character in which animated fil A": "Pre YUlygly VYVYUIN ee", "In the Simpsons, who is the Godfather o the Springfield mafia?": "Sisters", "Who is the king of Halloween town in \"Th Nightmare Before Christmas\"?": "Jack Skellington", "Which group was introduced by Peter Ka at/Live 8 in London?": "The Who", "The 2013 movie ‘After Earth’ stars the so of which famous actor?": "Will Smith", "Emma Watson and Ethan Hawke starred which 2015 thriller?": "Rearession", "Which comedian was often accompanie by/his Diddymen?": "Ken Dodd", "Alex is a character in which animated fil A": "wry ww", "What is the title of the fourth instalment the Jackass film series released in 2013?": "Jackass Presents: Bad", "Scrat is a character in which animated fi In?": "Ice Age", "Which singer had a 2008 hit with the son If Were A Boy’?": "Beyonce", "Who is the original presenter of ‘America Next Top Model’?": "Tyra Banks", "What superhero is Wyldstyle's boyfriend | \"The Lego Movie\"?": "Batman", "Which of these animated series was NO created by Mike Judge?": "Family Guy", "Dory was a character in which animated fi In?": "Finding Nemo", "Which of these horror films was release January 2013?": "Texas Chainsaw 3D", "In which year did Frank Zappa die? A": "1993", "Which cartoonist married cake-maker Ja Asher?": "Gerald Scarfe", "Vincent Kartheiser plays the role of who Mad Men?": "Pete Campbell", "What is the name of Yogi Bear's girlfrien A": "Vilinty", "Which cartoon character has a dog calle Gnasher?": "Dennis the Menace", "For which TV show did David Mitchell wi the Best Comedy Performance BAFTA in": "", "What movie star did the voice of Anasta in Anastasia\"?": "Meg Ryan", "Mark Ruffalo and Michael Keaton starre which 2015 film based on a true story?": "Spotlight", "Slinky is the official toy of which state’ A": "ay ee oe", "What is the name of the main character the TV show Mad Men?": "Don Draper", "Who was the director of No Country for Men?": "Joel and Ethan Coen", "In the Howard The Duck movie, what doe Howard smoke?": "Cigars", "Who had a UK No.1 with 'Fernando' ? A": "Abba", "What kind of animal is \"Curious George’ A": "FN IVIMIEING y", "Fill in the blanks of a famous Walter Sco work \"The ____ of Lammermoor\"?": "Bride", "Bruce was a character in which animate fi In?": "Finding Nemo", "Which of these TV shows had a characte called Ted Mosby?": "How | Met Your Mother", "Which of these is a favourite saying of B Simpson?": "Eat mv shorts", "On whose life was the CW TV sitcom ‘All Us\\based?": "Will Smith", "In 'The Big Bang Theory’, what actor play Raj, Koothrappali?": "Kunal Nayyar", "Who was the director of ‘The Dark Knigh A": "MITTTOLU VETS INUIGIE", "Which actor played the superhero Ant-M inthe 2015 film?": "Paul Rudd", "lan Brown is the lead singer of which ba A": "PEI VYIVIle INU OCS", "Carter Bryant created which hit toy rang A": "MIialse YViliv", "Which movie that was released earlier th the others?": "Big", "Who portrayed Detective Andy Sipowicz NYPD Blue’?": "Dennis Frankz", "Tony Hatch composed the theme for whi British Soap?": "Emmerdale", "Which of these Pixar movies was release in 2001?": "Monsters, Inc.", "In what movie does Will Ferrell play the e fashion mogul Jacobim Mugatu?": "Zoolander", "Which James starred in the TV series 'Th Virginian’?": "James Drury", "What legendary actor voiced Unicorn int 1986 movie 'The Transformers Movie’?": "Orson Welles", "Which comedy introduced us to the geni that was Robin Williams?": "Mork & Mindy", "How is the Planet Express ship powered Futurama’?": "Dark Matter", "What band did Sammy Hagar start with A": "Laura Pyper", "Who starred with Steve Carell in the mov Date Night?": "Tina Fey", "Danny Boyle directed Michael Fassbend in which 2015 biopic?": "Steve Jobs", "How many toes does Bugs Bunny have o each foot?": "Three", "Who voiced Prince Charming in \"Shrek A": "PAMPER tt", "Who directed the 2013 movie 'The Hobbi The Desolation of Smaug'?": "Peter Jackson", "Aaron Hotchner is a maine which hit show?": "AIS", "Which composer provided the music for the ballet ‘Coppelia’?": "Delibes", "Who directed the film 'JFK'? A": "Oliver Stone", "What is Ben E.King's real surname? A": "Nelson", "Marlin was a character in which animated film?": "Finding Nemo", "Fill in the blanks of a famous work by Thomas Love Peacock \"The ____ Castle\"?": "Crotchet", "Which actor did not play a captain in an Airport film?": "Paul Newman", "What type of dog was Scooby Doo?": "Great Dane", "Name the smash hit comedy with Ross, Rachel, Joey etc?": "Friends", "Which comedy police drama features Shawn and Gus?": "Psych", "Who directed The Sound of Music? A": "Robert Wise", "What is Moby's real first name? A": "Kajagoogoo", "Ted Danson ran a Boston bar in which classic comedy?": "Cheers", "Diane Keaton and John Goodman starred in 201 5's 'Christmas with the... who?": "Coopers", "Bruce was a character in which animated film?": "Finding Nemo", "What was the surname of Ivor the Engine's driver?": "Jones", "Which actor played the superhero Ant-Man inthe 2015 film?": "Paul Rudd", "Which S is not an American artist? A": "Shaggy", "Channing Tatum returned as which character in a sequel entitled 'XXL in 2015?": "Magic Mike", "Who directed 'Earth's Mightiest Heroes' in 2015's ‘Avengers: Age of Ultron’?": "Joss Whedon", "Where was '80s band Kraftwerk from? A": "Germany", "Who was backed by The Bluenotes? A": "Harold Melvin", "The Hamilton Family is central to which British soap?": "River City", "Complete the advertising slogan: 'P-P-Pick upia wa?": "Penguin", "Who played the role of Jodie in the TV show ‘Luther’?": "Laura Pyper", "In The Simpsons, what sort of creature is Santa's Little Helper?": "Dog", "What are Gru's little yellow friends called in ‘Despicable Me\"?": "Minions", "What color is Lightning McQueen in the movie ‘Cars’?": "Red", "Who had a 2006 hit with 'Bad Day’? A": "Daniel Powter", "The TV show, 'The Waltons’ was set in which US state?": "Virginia", "Which pop star played the title role in the 1996 film Evita?": "Madonna", "Who played the role of Katniss Everdeen in the film ‘Hunger Games: Catching Fire’?": "Jennifer Lawrence", "Who first appeared in ‘All Star comics' in 1941?": "Wonder-Woman", "Who were 'Pumping Up The Volume’ in their disco hit of 1987?": "MARRS", "What job did singer Perry Como have before he became famous?": "Barber", "Who plays the role of Oz in the film 'Oz the Great and Powerful’?": "James Franco", "Which animated movie featured a Selena Gomez song on it's soundtrack?": "Tinkerbell", "Peter Cattaneo directed which famous UK film?": "The Full Monty", "Which album was Turkey's Tarkan first international release?": "Tarkan", "Meccano was started by whom? A": "Frank Hornby", "Who played the title role in the 1994 film, Muriel's Wedding?": "Toni Collette", "lan Lavender and Clive Dunn featured in which sitcom?": "Dads Army", "Who directed the film ‘The Silence of the Lambs’?": "Johnathan Demme", "Which country are rock band The Manic Street Preachers from?": "Wales", "In what year did Disney release ‘Cinderella’?": "1950", "Which of these bands is/was a trio? A": "Hanson", "Where were the band Megadeth from? A": "USA", "“The human torch was denied a bank loan.” coines from which comedy film?": "Anchorman", "Who was Katy Perry kissing at the top of the charts in 2008?": "A girl", "In 1980, who was 'Off the Wall’? A": "Michael Jackson", "What kind of creature was Cody in ‘Surf's Up)?": "Penguin", "Finish the band name: Judas A": "Priest", "The 2013 movie ‘The Great Gatsby’ is based on a novel by who?": "F. Scott Fitzgerald", "What is the name of Drake's uncle? A": "Larry", "Which Disney movie are Hera and Zeus from?": "Hercules", "Released in 1989, what famous pop star sang ‘Like a Prayer?’": "Madonna", "Whose album ‘Always and Forever' gives a clue to their name?": "Eternal", "Which cartoon character was ably assisted by/Spot the Cat?": "Hong Kong Phooey", "Which character was played by Alice Englert in the film Beautiful Creatures?": "Lena", "What kind of dinosaur is Littlefoot in \"The Land Before Time\"?": "Brontosaurus", "Which was the top-earning animated film ofthe 90s?": "The Lion King", "Who is the voice of Anna in the 2013 movie Frozen’?": "Kristen Bell", "Which band is not from Scotland? A": "Saw Doctors", "Which 1991 classic starring Keanu Reeves was remade in 2015?": "Point Break", "Who eats a fish called Wanda in \"A Fish Called Wanda\"?": "Otto", "What color dungarees does Super Mario wear?": "Blue", "Name the toy that is a heavy rubber balloon.": "Space Hopper", "In which musical does Fagin appear? A": "Oliver!", "Shenzi is a character in which animated film?": "The Lion King", "Which one of Scooby Doo's human chums wears glasses?": "Velma", "What was the name of Sacha Baron Cohen's Kazakhstan character?": "Borat", "In which city is 'CSI:Crime Scene Investigation set?": "Las Vegas", "Who directed the film ‘Gladiator’? A": "Ridley Scott", "What year did Jimi Hendrix die? A": "Helen", "Fill in blanks in the title of a RL Stevenson work \"The __ Arrow\"?": "Black", "Who was the first host of 'Never Mind The Buzzcocks’?": "Mark Lamarr", "Roquefort was a character in which animated film?": "Aristocats", "In what city did Prince grow up? A": "Minneapolis", "Which F is not an American band? A": "Fun Boy Three", "Which pop group was formed by Don Henley & Glen Fry in 1972?": "Eagles", "Continental Drift’ is a sequel to which animated film?": "Ice Age", "Michael Chiklis was the star of which US Cop show that first aired in 2002?": "The Shield", "Where is Shrek's home in the movie \"Shrek\"?": "A Swamp", "Which animated movie is set in the Valley of Peace?": "Kung Fu Panda", "What type of animal was Mr Ed?": "Horse", "Who did the voice of Batty in \"FernGully: The Last Rainforest\"?": "Robin Williams", "Who was the director of ‘Avatar’? A": "James Cameron", "Which of these is the correct name fora 2013 film?": "World War Z", "How did Eddie Cochran die in 1960? A": "Car Crash", "Who was the main, recurring villain in 'The X Flies'?": "Smoking Man", "Which fruit did The Stranglers take into the charts in 1977?": "Peaches", "Who directed the 2013 movie ‘The Counsellor?": "Ridley Scott", "Which animated film is set in the small town of Blithe Hollow?": "Paranorman", "Which P is not an American singer? A": "Robert Palmer", "Which comedy was set in a college in Greendale, Colorado": "Community", "How was B.0.B feeling according to the title of a 2012 song?": "So Good", "What is the name of Lebanese singer Nicole Saba's baby girl?": "Nicole", "Shanti is a character in which animated film?": "The Jungle Book", "What was The Sky At Night about? A": "Astronomy", "What is the nickname of Bruce Springsteen?": "The Boss", "Whose 1974 album was called 'Sheet Music’?": "10cc", "What was the name of Kesha's debut single in August of 2009?": "Tik Tok", "What sort of creature was Idris in the TV animation Ivor the Engine?": "Dragon", "Mel Blanc, who provided the voice for Bugs Bunny, was allergic to what?": "Carrots", "Whose real name is Gaynor Hopkins? A": "Bonnie Tyler", "Which of these law dramas was not on air inthe ‘90s?": "The Defenders", "Who is the lead singer of Blondie? A": "Debbie Harry", "Singer Amr Mostafa was born where? A": "Cairo", "Which C is not an American singer? A": "Jose Carreras", "Who is Mr. Fox's wife in \"Fantastic Mr. Fox\"?": "Felicity", "What is the name of the Corpse Bride in ‘Corpse Bride\"?": "Emily", "In Mrs Doubtfire what does Robin Williams’ character dress up as?": "A Woman", "Which saint is mentioned in the Coldplay hit'Viva La Vida’?": "Peter", "According to Madonna, what 'makes the people come together’?": "Music", "Captain Hook is the enemy of which Disney heto?": "Peter Pan", "Who was the former medical examiner in CSI: New York?": "Sheldon Hawkes", "Mark Ruffalo and Michael Keaton starred in which 2015 film based on a true story?": "Spotlight", "In which year was the movie ‘Ratatouille’ released?": "2007", "Lord Farquaad is the villain in which movie?": "Shrek", "Who hosted Double Your Money? A": "Hughie Green", "Fill in the blanks of a famous Walter Scott work \"The ____ of Lammermoor\"?": "Bride", "Who was the director of Iron Man? A": "Jon Favreau", "Which actor played Alex in the TV show Family Ties'?": "Michael J Fox", "Forever After’ is the fourth film in which sefies?": "Shrek", "In the Simpsons, who is the Godfather of the Springfield mafia?": "Don Vittorio", "On'B.J. and the Bear’, what kind of animal was Bear?": "Chimpanzee", "Complete the title of the 2015 film: ‘Best Of wi": "Enemies", "In what year was 'Brave' released? A": "2012", "Who was the voice of Scar in 'The Lion King’?": "Jeremy Irons", "Which US group topped the UK charts in 1975 with 'Ms Grace’?": "Tymes", "Who was the director of Lincoln? A": "Steven Spielberg", "Whose real name is Paul Hewson? A": "Alecia", "Who played Ken in the film A Fish Called Wanda?": "Michael Palin", "Which James starred in the TV series 'The Virginian’?": "James Drury", "Who gets Springfield stuck under a dome in‘The Simpsons Movie\"?": "Homer", "Which member of the Simpsons has sisters called Patty and Selma?": "Marge", "Who plays the lead role in the TV show House of Cards?": "Kevin Spacey", "What type of animal was Skippy?": "Kangaroo", "Former American Idol Judge Simon Cowell is from which country?": "England", "Who was the director of ‘Million Dollar Baby’?": "Clint Eastwood", "What is Debbie Harry's heart made of, according to her song?": "Glass", "Gourmet Night is a famous episode of which TV sitcom?": "Fawlty Towers", "What type of dog is Ren in ‘The Ren and Stimpy Show’?": "Chihuahua", "Whom did \"Harry\" meet in the film with Billy Crystal?": "Sally", "Who said it 'Don't Matter’ in 2007? A": "Akon", "Which fairy is the best friend of Disney's Peter Pan’ ?": "Tinker Bell", "Shani is a character from which range of dolls?": "Polly Pocket", "Dory was a character in which animated film?": "Finding Nemo", "Complete the title of this Danish TV show The": "Killing", "Walter Lantz created which cartoon character?": "Woody Woodpecker", "What is David Bowie's nationality? A": "British", "Who did the voice of Mr. Fox in \"Fantastic Mp Fox\"?": "George Clooney", "What animation studio made the children's movie \"Chicken Run\"?": "Aardman Animations", "Eddie Valiant is a character in which animated film?": "Who Framed Roger Rabbit", "Where were Happy Mondays formed? A": "Manchester", "Who recorded the album 'Medusa’? A": "Annie Lennox", "Lego was invented in which country? A": "Denmark", "Limahl fronted which '80s band? A": "1958", "What deadly virus threatens Frank's health in ‘Osmosis Jones\"?": "Thrax", "What was the name of Gnarls Barkley's breakout song in 2006?": "Crazy", "Which TV show won the Emmy for Best Drama from 2008 to 2011?": "Mad Men", "Which two colours make up Dennis the Menace's jumper?": "Black and red", "Where were The Temptations formed? A": "Detroit", "Dawn and Beryl are the main characters in which show?": "The Liver Birds", "Who hosted the 2014 Grammy Awards? A": "LL Cool J", "Weekly Ranking TT -": "Tr . .-I°£L", "Who does the voice of Gru in \"Despicable Me’?": "Steve Carell", "Where were the Fleet Foxes formed? A": "Seattle", "Finish the band name: R.E. . A": "", "Which artist sang ‘The Lazy Song’? A": "Bruno Mars", "What was Aaron Spelling's, first comedy back in 1977?": "Hawaii Five O", "Which of these was a hit for Abba ? A": "S.0.S.", "Which instalment of the 'Fast & Furious’ sefies was released in 2015?": "", "What did David Bowie call his son? A": "Zowie", "Of these, which was a popular children's show from 1996?": "Arthur", "Which company released the Xbox? A": "Microsoft", "Who directed the 2009 adaptation of ‘Watchmen’?": "Zack Snyder", "Who played Julian's mother in the 2013 movie Only God Forgives?": "Kristin Scott Thomas", "Who played the role of Felonius Gru in the film ‘Despicable Me 2'?": "Steve Carell", "Who was 'Sober' in the 2009 charts? A": "Pink", "Which Carry On film had the tagline A great guy with his chopper?": "Carry On Henry", "In ‘Breaking Bad’, who is Shot in the head by/Walter?": "Jack Welker", "1987, the hit toy Families was released?": "Sylvanian", "Which Hollywood star played the boxer Billy Hope in 2015's ‘Southpaw’?": "Jake Gyllenhaal", "Marti Pellow fronted which band? A": "Wet Wet Wet", "What is the nickname of Billy Joel? A": "The Piano Man", "In which sitcom would you find the Cunningham family?": "Happy Days", "Who played the snobbish Judge Smails in Caddyshack?": "Ted Knight", "Who sang the song 'We Can't Stop’? A": "Miley Cyrus", "What's Tom Jones' real surname? A": "42", "In which city did the Super Furry Animals form in the 1990s?": "Cardiff", "How is the Planet Express ship powered In Futurama’?": "Dark Matter", "Which cartoon character was voiced by Wayne Allwine for 30 years?": "Mickey Mouse", "Actor Romany Malco was featured in which 2008 comedy?": "Baby Mama", "Who performed with Enrique Iglesias on the song ‘| Like It'?": "Pitbull", "Which character does June Brown play in EastEnders’?": "Dot Cotton", "Which song title was also a David Lynch film?": "Blue Velvet", "Where was Daniel Bedingfield born? A": "New Zealand", "Who does the voice of Puss in Boots in ‘Puss in Boots\"?": "Antonio Banderas", "Which comedian famously played a trombone?": "Jimmy Edwards", "What was Clint Eastwood's debut film as director?": "Play Misty for Me", "Who had a 1995 hit with Boombastic? A": "Shaggy", "What 1994 movie was about a cub called Simba?": "The Lion King", "When was the original Nutty Professor film made?": "1963", "Foulfellow Fox is a character in which animated film?": "Pinocchio", "What's missing from the ABC hit from the ‘80s: ‘Poison ...?": "Arrow", "Who was backed by The Blue Caps? A": "Gene Vincent", "Finish the title of this popular children's show from 1996: \"Hey __!\"": "Arnold", "Which comedy/animation is set at ISIS in New York?": "Archer", "Which Ninja Turtle wears a blue mask in \"TMNT\"?": "Leonardo", "Which S is a group from the US? A": "Nena", "What ingredient did Sue used for a smoothie she made?": "Bones of cow", "Which of these was a popular animated children's show from 1997?": "Recess", "Finish the name of the famous New Wave band: Talking .": "Heads", "Which 'G' singer is from the US? A": "David Gates", "Complete the name of this iconic US TV sefies. The Wonder": "Years", "Complete the title of the Cat Stevens hit: \"... Has Broken’?": "Morning", "Which bird was ‘Rockin ... for Michael Jackson in the '70s?": "Robin", "Complete the title of the 201 5 movie: 'What We Do In The": "Shadows", "Who made the 1977 song 'Heroes'? A": "David Bowie", "Little 'who' sang 'The Locomotion’? A": "Eva", "Which member of the Backsteet Boys has the surname Littrell?": "Brian", "What was Marc Bolan's real surname? A": "Feld", "Complete the name of this hit US TV show. The Good": "Wife", "What is the main instrument in Vivaldi's The Four Seasons’?": "Violin", "Yoko Ono was born in which country? A": "Japan", "In which year was Paul Young born? A": "1956", "What superhero is Wyldstyle's boyfriend in \"The Lego Movie\"?": "Batman", "What family runs the chicken farm in ‘Chicken Run’?": "The Tweedys", "In 'Friends', what particular CD does Chandler have two copies of?": "Annie The Musical", "In 'The Big Bang Theory’, what actor plays Raj, Koothrappali?": "Kunal Nayyar", "Beyonce is married to which rapper? A": "Jay-Z", "From 1972-1978, Fire Station 51 was the headquarters for which TV show?": "Emergency", "In what decade is the TV show The Americans set?": "1980s", "In 'The Little Mermaid’, who is Ariel's father?": "The King", "Ron Howard's 2015 movie ‘In The Heart Of The Sea’ is the story that inspired which lags": "", "Who is the most filmed comic strip character?": "Zorro", "How would you categorize the film ‘Texas Chainsaw Massacre’?": "Horror", "Which cartoon character lives in London and like \\91making new friends\\92?": "Hello Kitty", "Which animated TV character's kids are called Rod and Todd?": "Ned Flanders", "How many years did Disney spend making \"Tangled\"?": "", "In what year did Orange is the New Black first air?": "2013", "Finish the name of the television series title: Everybody Loves .": "Raymond", "What music genre is most often associated with Robert Miles?": "Trance", "Who was the youngest Beatle? A": "John", "What was the second animated feature film from Disney?": "Pinocchio", "With what kind of love did Donny Osmond have a hit in 1972?": "Puppy", "Which rock star co-produced the film Enigma?": "Mick Jagger", "Which cartoon cop worked for the Finkerton Detective Agency?": "Inch High Private Eye", "Which of these was a hit for Enya? A": "Orinoco Flow", "How was J-Kwon feeling in 2004? A": "Run DMC", "Who wrote the song A Perfect Day ? A": "Lou Reed", "How many seasons of the TV show, The Twilight Zone, were made in total?": "Five", "What music genre is most often associated with Donna Summer?": "Disco", "Which of these is Drake's uncle? A": "Teenie Hodges", "What nationality are The Cardigans? A": "Swedish", "What was Joan Jett's real surname? A": "Larkin", "Who voiced the Corpse Bride in \"Corpse Bride\"?": "Helena Bonham Carter", "Created in 1993, what were \"Power Rangers\"?": "TV Show Characters", "In what year was 'Bedknobs and Broomsticks’ released?": "1971", "Which Spice Girl was born in Essex? A": "Posh", "Which 2015 film release starred Amy Poehler?": "Trainwreck", "Juan Pablo Galavis will star in which reality show in 2013?": "The Bachelor", "Who taught us to do 'The Twist’? A": "Chubby Checker", "Who was backed by his All Stars? A": "Junior Walker", "Who played reporter Cal McCaffery in ‘State of Play’?": "John Simm", "What is Homer Simpson's middle name? A": "a", "Where were The Specials formed? A": "711", "Which of these 2013 movies stars Christian Bale, Bradley Cooper and Amy a": "", "In 'Cheers', Sam was a former pitcher for which team?": "Boston Red Sox", "How many Proclaimers are there? A": "Bono", "Wendy and Archie Leach are leading characters in which famous British [7 tw": "", "What was ‘Friends’ scheduled to be called originally?": "Insomnia Cafe", "What was a hit for Dire Straits? A": "Love Over Gold", "What is Simon Cowell’s middle name? A": "Phillip", "What part of Pinocchio grew when he lied in/a Disney movie?": "Nose", "Who played in Bilbo Baggins the 2013 m vie 2 The Hobbit: The Desolation of iw": "", "Whose real name is Sannia Carlson? A": "Whigfield", "In which year did the TV show Dallas first aipin the US?": "1978", "Airwolf was a US TV show about what mode of transport?": "Helipcopter", "Which of these sequels was released in 1999?": "Toy Story 2", "What sort of music do the Black Eyed Peas generally perform?": "Hip Hop", "Monsters, Inc.’ won an Academy Award for what?": "Best Original Song", "Which Carry On movie was released before the others?": "Nurse", "What is the first track on 'Spice'? A": "Wannabe", "Which comedy introduced us to the genius that was Robin Williams?": "Mork & Mindy", "Tony Hatch composed the theme for which British Soap?": "Emmerdale", "Who had a 'Case of the Ex' in 2001? A": "Mya", "Bono is lead singer of which rock group? A": "Vo", "Which 'B' group is from the USA? A": "Beastie Boys", "Kim Cattrall had a starring role in which 1987 movie?": "Mannequin", "Aurora is from which cartoon film? A": "Sleeping Beauty", "What kind of business is 'Spaces'? A": "Spa", "Who had a 2012 hit with 'Drive By’? A": "Train", "Which company released the Wii? A": "Nintendo", "Who plays Ali G in the British film?": "Sacha Baron Cohen", "Which cartoonist married cake-maker Jane Asher?": "Gerald Scarfe", "Finish the title of Wilson Pickett's song: ‘Mustang -": "Sally", "Who was the voice of Shenzi, the female hyena, in 'The Lion King’?": "Whoopee Goldberg", "Which of these is the name of a popular toy?": "Polly Pocket", "If a contestant asked for \"One large and five small\" which game show would they be": "", "Who plays Harry and Sally in When Harry Met Sally?": "Billy Crystal and Meg Ryan", "Which singer was born Diane Earle? A": "Diana Ross", "Freddie Mercury fronted which band? A": "Queen", "What is the name of Madonna's son? A": "Rocco", "Who sang the song ‘Love Runs Out’? A": "OneRepublic", "What is WALL-E's job on Earth in the movie WALL-E\"?": "Trash Compactor", "Frances Reid is famous for her portrayal of Alice Horton on which TV show?": "Days of our Lives", "Which spice girl comes from Leeds? A": "Mel B", "Who did the voice of Po in \"Kung Fu Panda\"?": "Jack Black", "In ‘The Simpsons' episode 'The Last Temptation of Homer’, how is Homer yy. FF FE. Fete lll": "ner", "Which Lis a singer from the US? A": "Chris Isaak", "Which animated movie is mainly set on Dixon Ranch?": "Home on the Range", "Who was the voice of Zazu the hornbill in The Lion King’?": "Rowan Atkinson", "Who released hit '80s album ‘Rio’? A": "Duran Duran", "What was a hit for the Eurythmics? A": "Sweet Dreams", "Ellery Hanley was a contestant on which TV\\show in 2009?": "Dancing On Ice", "Who was Yogu Bear's sidekick? A": "Boo Boo", "Who had the 'Midas Touch’ in 1986? A": "Midnight Star", "Emma Watson and Ethan Hawke starred in which 2015 thriller?": "Regression", "Who was the captain of the Yellow Submarine?": "Old Fred", "Finish the band name: Pearl A": "Jam", "Who wrote and starred in Hot Fuzz? A": "Simon Pegg", "Which of these was NOT one of Mr.Benn's adventures?": "The Shopkeeper", "Incredibles was released in what year? A": "42VUUT", "Which cartoon series made its first appearance as part of The Tracey Ullman": "", "What Springfield resident does Lisa develop a crush on in \"The Simpsons uns": "", "Who sang the song 'Sweet Emotion’? A": "Aerosmith", "Which book title was a hit for Metallica? A": "PUT VVEIMEETE PEI WOT PUTO", "Ruth Handler created which world famous toy?": "Barbie", "Kenneth Branagh directed which classic story in a live-action version in 2015?": "Cinderella", "In which city is \"One Hundred and One Dalmatians’ set?": "London", "The 2013 movie ‘After Earth’ stars the son of which famous actor?": "Will Smith", "Which David is not from the USA? A": "David Essex", "What is Daffy Duck's middle name? A": "Dumas", "Who was 'Hot In The City’ in 1988? A": "Billy Idol", "Which rapper featured on LII' Kims No.2 track ‘Magic Stick’?": "50 Cent", "Which of these was a popular children's show from 1993?": "2 Stupid Dogs", "What was the budget for the Pixar movie WALL-E\"?": "$180 million", "Who was the director of 'The Dark Knight’? A": "Wilt hNwtVy}Y! IST INVIGHSI", "Which of these 2013 movies has been nominated for a Best Visual Effects Oscar?": "The Lone Ranger", "Which rocker was Carly Simon married to? A": "YVGITINSO 1TAaylV! a", "What did Josh Hartnett's character try to give up in 40 Days and 40 Nights?": "Sex", "Which member of KISS dated Cher? A": "Gene Simmons", "Princess Atta appears in which film? A": "rm wuVy~ bn", "What sort of show does Graham Norton usually present?": "Chat show", "Gerry Anderson is famous for which television show?": "Thunderbirds", "The 2013 movie Only God Forgives is set where?": "Bangkok", "Morrissey fronted which '80s band? A": "The Smiths", "Who sang about 99 red balloons? A": "French", "What was a hit for Debbie Harry? A": "French Kissin", "What was the title of the 2015 ‘Mission: Impossible’ release?": "Rogue Nation", "Who provides the voice for Kung Fu Panda?": "Jack Black", "What is the name of the pub in the soap EastEnders’?": "The Queen Vic", "Hogan's Heroes was set during which conflict?": "World War II", "Which of these 2013 films has been nominated for a Best Animated Feature Lr _ w«": "Tne Croods", "What is Ozzy Osbourne's real first name? A": "VMI a", "Complete the title of the 2015 Pixar release: ‘The Good -": "Dinosaur", "The Script hail from which country? A": "Ireland", "Which of these rockers is a guitarist? A": "WTETTE PII IA", "Bradley Cooper and Jennifer Lawrence reunited for which 2015 David O'Russell": "", "Which day was a hit for the Moody Blues? A": "PUuUweCvUGayY TALE", "How many characters does Mike Myers play in Austin Powers in Goldmember?": "Four", "Finish the band name: Fleet A": "Foxes", "What comedy was marketed with the tagline: Grab life by the ball?": "Dodaeball: A True Underdog", "Which of these Pixar movies was released in 2001?": "Monsters, Inc.", "Which TV show was cancelled in 2006? A": "ey veer", "What did Gilbert O'Sullivan ask in 1974? A": "VVELY Wt VVETy Wil Wwiry", "Which film shows Tom Cruise dancing in a pink shirt and his underwear?": "Risky Business", "Buzz Lightyear is a toy in which Disney Pixar movie?": "Toy Story", "How many Pet Shop Boys were there? A": "Two", "Which Zoo sang ‘Spaceman’ in 1996? A": "Babylon Zoo", "What was Jimi Hendrix's first hit single? A": "! I~) vVUwe", "Simon Le Bon fronted which band? A": "Duran Duran", "Who reprised his role as Tony Stark in the film ‘Iron Man 3'?": "Robert Downey, Jr.", "Who voiced Vitruvius in \"The Lego Movie\"? A": "IVIMIPYGGEE PT Peeriiael", "Who directed the film ‘Finding Dory’? A": "FMIUEPOVWY VLGIIUEt", "Who is the original presenter of ‘America's Next Top Model’?": "Tyra Banks", "In what year did The Good Wife first air? A": "e2VUVU2", "In 'The Dukes of Hazzard’, what animal does Al always associate Marcy with?": "Hen", "Which was Woody Allen's first film as director?": "What's Up. Tiger Lily?", "Seth MacFarlane returned which foul-mouthed character in 2015 for a _ ir": "", "Guy Ritchie directed which 2015 film based ona 60's TV series?": "The Man from U.N.C.L.E.", "As of 2013, how many Academy Awards has Pixar won?": "2/7", "How is Jennifer Lopez often known? A": "J.Lo", "What shape is the popular toy Frisbee? A": "NMITUIS", "What is Homer Simpson's wife called? A": "IVICGI yw", "Which of these featured on Chingys 2004 hit'One Call Away’?": "J. Weav", "Who sang the 1970 single ‘Lola’? A": "The Kinks", "Who sang 'With Arms Wide Open’? A": "Pearl Jam", "Which network airs ‘American Idol'? A": "Fox", "Which land did the Blue Meanies invade? A": "pYePprwVt ioe a", "Les Gray fronted which \"70s group? A": "Mud", "In what year is the movie 'Wall-E' set? A": "42VUUVYU", "Kanga is a character in which Disney film? A": "HIN Grin t VV oe", "Carter Bryant created which hit toy range? A": "MIialse YViliv oe", "Elf starred which of these comedians? A": "VViIE TT Oil a", "Which US Soap Opera first aired on CBS in 1 956?": "As The World Turns", "Allied Forces’ is an album by which group? A": "re a", "Which band had an album called 5150? A": "VQOIt trawl", "Alex is a character in which animated film? A": "wreioy ew“ oe", "Who was the voice of Shrek in ‘Shrek’? A": "IVITINN aa vw oe", "Who played the title role in the 2013 film The Great Gatsby’?": "Leonardo DiCaprio", "Which 2015 movie about a bear featured Nicole Kidman?": "Paddinaton", "Who was the director of The Hurt Locker? A": "PNG Yr Wigeluvv ee", "In what year did The Sopranos first air? A": "4H oa", "What number was not a Boy Band? A": "Suggs", "What was Van Morrison's first singles hit? A": "MivvvVil yw Mit", "Who made the album Astral Weeks? A": "Van Morrison", "In what year did Disney release the film \"Pocahontas\"?": "1995", "On which channel would you expect to see ‘Countdown’?": "Channel 4", "Where in the USA was the 1980 musical coinedy, The Blues Brothers filmed?": "Chicago", "Who was the director of The Pianist? A": "ENWJEEICATE PF WIQAPIONN", "For which TV show did David Mitchell win the Best Comedy Performance BAFTA in": "", "Carey Mulligan starred in which classic tale fona 2015 film?": "Far from the Madding Crowd", "Hop Sing is from which TV show?": "Bonanza", "But you think you're an intellectual, don't you, ape?. Name the film?": "A Fish Called Wanda", "How much is Vermont Avenue worth in Monopoly?": "S100", "Which of these is the name of a rock band? A": "", "Optimus Prime is from which cartoon? A": "PIQPhOIMVITIIVRivo a", "In what year did House of Cards first air? A": "e2vVviv", "Which of these was a TV show which began in 1990?": "Wings", "Who got to number 2 in 1999 with Tequila? A": "PeEIiViviviVil", "The 2013 movie 'The Hunger Games: Catching Fire' was released in which — tL": "A eaumitmt", "What movie star did the voice of Anastasia in Anastasia\"?": "Meg Ryan", "Which US TV company produces The Simpsons?": "Fox", "Disney's 'Dumbo had extremely large what? A": "bRUlvV", "Frankie Muniz played the title character in which of these TV shows?": "Malcolm in the Middle", "In what year did TV show 24 first air? A": "2vVuvu i", "In what movie is there a character named Thumper?": "Bambi", "In ‘Monsters, Inc.' Roz resembles a what? A": "vilty", "| spent like three hours shading the upper lipais a line from which comedy?": "Napoleon Dynamite", "How many lines does a sonnet have? A": "14", "Who directed the 1977 movie 'Star Wars' ? A": "Vveviygy tvveGy oe", "Slinky is the official toy of which state? A": "Perillo yiVvanina a", "Who was the director of The Fighter? A": "MaAVIM VM. IAUVIL!II", "Where were the Jedward twins born? A": "Dublin", "Bratz dolls were released in which year? A": "42vuvuit", "Kala is a character in which animated film? A": "1aI4atil a", "What is the game of Yahtzee played with? A": "VWiIivw", "What was Play-Doh originally sold as? A": "VQONVaVC! WIG!", "Who plays drums in The Rolling Stones?": "WIICGATIINN V¥atly", "Finish the band name: Mazzy A": "Florida", "Kaa is a character in which animated film? A": "Pre YUlygly VYVYUIN", "In what city was the original 24 set? A": "BV MIN Iw oe", "Yeti is a character in which animated film? A": "IVIVJITOUULTSO, Til", "What is the name of Gru's irritating matchmaking neighbor in the 2013 movie st le OR": "", "Zazu is a character in which animated film? A": "Prim kIVitl LISSUL USS oe", "Which of these is the name of a toy gun? A": "VY Vuil", "Claude Frollo was a character in which animated film?": "The Hunchback of Notre", "Which rock musician organized Live Aid? A": "MYN Veiruvl", "In ‘The Simpsons’, what occurs every time anjestablishing sh shot of the Springfield 1... mMm.seke.k. op lm": "AN unseen crow OF raven", "In what year was ‘Fantasia 2000' released? A": "4A Sf", "Who is the lead singer of the band Pulp? A": "VOUIVIV YVVVUNw! oe", "Who was the director of Mulholland Drive? A": "ywvuviu a Ae oe", "Fungus is a character in which animated film?": "Monsters, Inc", "In which year was Pixar's ‘Toy Story’ released?": "1995", "In ‘Futurama’, what color is Leela's hair? A": "Purpre", "Who was the lead singer in Led Zeppelin? A": "PNY E OE PCA", "Who was the director of The Sixth Sense? A": "PVE. ENEUETG OLITYQIIaQarl", "Which state do Limp Bizkit come from? A": "PIMmriua", "What is the name of Yogi Bear's girlfriend? A": "Viltuy", "Which animated film does Steve Carrall play the role of Gru?": "Despicable Me", "Who voiced Prince Charming in \"Shrek 2\"? A": "INU Vere bVerect", "Flynn Rider is from which cartoon film? A": "J SIU ss JUNSe)", "What is the title of the fourth instalment in the Jackass film series released in 2013?": "Jackass Presents: Bad", "In ‘The Dukes of Hazzard’, when Al is in so h pain me goes to see Marcy's dentist, i Olt": "", "On which continent is ‘The Lion King' set? A": "FATITING", "What job does Charlie Brown's father do? A": "ywauinVvVrvl", "What color is Mike in ‘Monsters, Inc.;? A": "8 a", "What is will.i.am's other alias? A": "Zuper Blahq", "Ray Romano wrote and starred in which sitcom?": "Everybody Loves Raymond", "Who is the lead singer of the band Muse? A": "VIGIL DOCHIGHiry", "Name the show featuring 3 college dropouts and their drug dealer?": "Workaholics", "Who was Simba's father in ‘The Lion King’? A": "IvViIUtaoda", "Tom Hardy took over from Mel Gibson in 2015 for the 3rd instalment of which Cc fF eo ey": "", "Which D is a band from the States? A": "Doors", "Who was the director of Talk to Her? A": "MwuUuvYvU", "Which character does Ryan Gosling play in the : 2013 movie The Place Beyond the": "", "Who was the director of 'The Departed’? A": "IVICA UTE VUUUIOVLOWU", "What kind of animal was Disney's ‘Bambi’? A": "veri", "How | Met Your Mother is a show about Ted and his quest for what?": "", "How is Gordon Sumner better known? A": "Sting", "Which Academy Award did 'Toy Story’ win? A": "YRPEVIGLE POTTS VeETEIOTIt", "Boo is a character in which animated film? A": "IVIVJITOLUL SO, Til a", "Which country is the band AC/DC from? A": "PFAUVLIOATGS", "Which of these is the name of a band? A": "VETIeloV ll FAT VIG a", "From which show was Frasier a spin-off? A": "NVIIICVISO a", "Which legendary band released ‘The Wall’?": "PUNT hoyue", "Who was the director of ‘Star Wars’? A": "Vveviygy tvveGy oe", "What is T-Pain's name short for? A": "Tallahassee Pain", "Craig Charles and Chris Barrier star in which series?": "Red Dwarf'", "André Cassagnes invented which hit toy? A": "Ltull GA YINOLUI!I", "lan Brown is the lead singer of which band? A": "PEI VV IW OLY", "Where in England is Legoland located? A": "VVITIMOVI a", "Which Disney character had a mother called Kanga?": "Roo", "Which Disney film is based on a work by Vietor Hugo?": "The Hunchback of Notre", "In which US state was The Sopranos set? A": "INevY vvlory", "Which label did Kate Bush sign to? A": "EMI", "Which TV show is ‘Trapper John M.D. associated with?": "M.A.S.H.", "What kind of animal is Rango in \"Rango\"? A": "MEIICGAPIININNMVI! oe", "Which of these was a game played using discs?": "Pogs", "What band did Sammy Hagar start with? A": "IVIVVIILIUVOw a", "Who played the title role in the sitcom Joey?": "Matt LeBlanc", "Roo is a character in which Disney film? A": "VVEIPTIEING CEI F VMI a", "In which year was ‘A Bug's Life’ released? A": "'4#VU", "What 1997 movie was about Woody the cowboy doll?": "Toy Story", "In what US city is the show ‘Dexter’ set? A": "EVETQALTET oe", "Who did the voice of Donkey in \"Shrek\"? A": "Nt eee a", "Who was the voice of Woody in 'Toy Story'? A": "PMT? PIrQabine oe", "Evil Manta is a character in which animated film?": "The Little Mermaid", "Who was the director of Michael Clayton? A": "ey vw 7)", "What was the surname of the brothers who first formed AC/DC?": "Youna", "Which Kinks song was banned by the BBC? A": "RVI"}